function areaOfFigures (input){
let figure = (input[0]);
let a = Number(input[1]);
let res = 0;

if (figure === "square") {
    res = a * a;
} else if (figure === "rectangle") {
    let b = Number(input[2]);
    res = a * b;
} else if (figure === "circle") {
    res = Math.PI * Math.pow(a,2);
} else {
    let b = Number(input[2]);
    res = a * b / 2;
}
console.log(res.toFixed(3)); 
}

areaOfFigures(["triangle",
"4.5",
"20"])










// 7.	Лица на фигури
//Да се напише функция,  която получава като вида и размерите на геометрична фигура и пресмята лицето й. 
//Фигурите са четири вида: квадрат (square), правоъгълник (rectangle), кръг (circle) и триъгълник (triangle). 
//На първия ред на входа се чете вида на фигурата (текст със следните възможности: square, rectangle, circle или triangle). 
//•	Ако фигурата е квадрат (square): на следващия ред се чете едно дробно число - дължина на страната му
//•	Ако фигурата е правоъгълник (rectangle): на следващите два реда четат две дробни числа - дължините на страните му
//•	Ако фигурата е кръг (circle): на следващия ред чете едно дробно число - радиусът на кръга
//•	Ако фигурата е триъгълник (triangle): на следващите два реда четат две дробни числа - 
//дължината на страната му и дължината на височината към нея
//Резултатът да се закръгли до 3 цифри след десетичната запетая. 
